code-review/NRB_3471_3546/База_Стало/InformationRegisters/ЖурналИсходящихСообщенийKafka.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналИсходящихСообщенийKafka</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ключ</Name>
					<Comment>Ключ (key) сообщения Kafka</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтправкиСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправляемыйОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.УслугиДепозитария</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаНачисленныхКомиссий</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеКлиентам</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешнийИсточник</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВнешниеИсточники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ЖурналИсходящихСообщенийKafka/Ext/ManagerModule.bsl
// Добавляет сообщение в регистр
// Параметры:
//  ВнешнийИсточник - ПланВидовХарактеристик.ВнешниеИсточники - Внешний источник, по которому будет отправлено сообщение в Kafka
//  КлючИзJSON - строка - Ключ сообщения JSON
//  Сообщение - строка - текст сообщения JSON
//  Идентификатор - строка - ручной ГУИД сообщения в РС
//  ОтправляемыйОбъект - Ссылка - ссылка выгружаемого объекта
Процедура Добавить(ВнешнийИсточник, КлючИзJSON, Сообщение, Идентификатор = Неопределено, ОтправляемыйОбъект = Неопределено) Экспорт
	Если Идентификатор = Неопределено Тогда
		Идентификатор = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	Ключ = КлючИзJSON + ":" + Идентификатор;
	
	Набор = НаборСОтбором(ВнешнийИсточник, Идентификатор);
	СообщениеВНаборе = Набор.Добавить();
	СообщениеВНаборе.ВнешнийИсточник = ВнешнийИсточник;
	СообщениеВНаборе.Идентификатор = Идентификатор;
	СообщениеВНаборе.Ключ = Ключ;
	СообщениеВНаборе.ТипСообщения = КлючИзJSON;
	СообщениеВНаборе.Сообщение = Сообщение;
	СообщениеВНаборе.ОтправляемыйОбъект = ОтправляемыйОбъект;
	СообщениеВНаборе.ПериодСообщения = ТекущаяДатаСеанса();
	
	// Ограничения по длине ключа сообщения самой Кафки не существенны - так ограничение состоит в том что, длина ключа + длина служебных
	// атрибутов + длина самого сообщения не должны превысть максимальной длины сообщения, определенной настройками брокера Kafka
	// Однако тип ресурса "ключ" в этом регистре - строка длиной 100, так что больше 100 символов не влезет
	МаксимальнаяДлинаСтрокиВРесурсеКлюч = 100;
	Если СтрДлина(Ключ) > МаксимальнаяДлинаСтрокиВРесурсеКлюч Тогда
		СообщениеВНаборе.ОшибкаОтправки = Истина;
		СообщениеВНаборе.ОписаниеОшибки = "Длина ключа сообщения больше 100 символов";
	КонецЕсли;
		
	Набор.Записать();
КонецПроцедуры

Функция НаборСОтбором(ВнешнийИсточник, Идентификатор)
	Набор = РегистрыСведений.ЖурналИсходящихСообщенийKafka.СоздатьНаборЗаписей();
	Набор.Отбор.ВнешнийИсточник.Установить(ВнешнийИсточник, Истина);
	Набор.Отбор.Идентификатор.Установить(Идентификатор, Истина);
	Возврат Набор;
КонецФункции

// Отправляет сообщения из регистра в Kafka
// Параметры:
// КоличествоСообщенийКОтправке - Число - количество сообщений которые могут быть отправлены пр изапуске рег. задания
// УсловиеОтбораСообщений - Текст - Произвольное условие для отбора сообщений
Процедура ОтправитьСообщениеИсходящее(КоличествоСообщенийКОтправке = Неопределено, УсловиеОтбораСообщений = "") Экспорт
	
	ДанныеОтправкиСообщения = ДанныеКОтправке(КоличествоСообщенийКОтправке, УсловиеОтбораСообщений);
	Пока ДанныеОтправкиСообщения.Следующий() Цикл
		Если Не ЗаполненыКлючевыеПоля(ДанныеОтправкиСообщения) Тогда
			Продолжить;
		КонецЕсли;
		КафкаКлиент = Обработки.KafkaClient.Создать();
		Ответ = КафкаКлиент.РезультатОтправкиСообщенияПоВнешнемуИсточнику(ДанныеОтправкиСообщения);
		ЗафиксироватьРезультатОтправки(ДанныеОтправкиСообщения, Ответ);
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеКОтправке(КоличествоСообщенийКОтправке, УсловиеОтбораСообщений)
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЖурналИсходящихСообщенийKafka.ВнешнийИсточник КАК ВнешнийИсточник,
	|	ЖурналИсходящихСообщенийKafka.Идентификатор КАК Идентификатор,
	|	ЖурналИсходящихСообщенийKafka.Ключ КАК Ключ,
	|	ЖурналИсходящихСообщенийKafka.Сообщение КАК Сообщение
	|ИЗ
	|	РегистрСведений.ЖурналИсходящихСообщенийKafka КАК ЖурналИсходящихСообщенийKafka
	|ГДЕ
	|	НЕ ЖурналИсходящихСообщенийKafka.Отправлено
	|	И НЕ ЖурналИсходящихСообщенийKafka.ОшибкаОтправки
	|	&УсловиеОтбораСообщений
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЖурналИсходящихСообщенийKafka.ПериодСообщения";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораСообщений", УсловиеОтбораСообщений);
	Если ЗначениеЗаполнено(КоличествоСообщенийКОтправке) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ " + Строка(КоличествоСообщенийКОтправке));
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Процедура ЗафиксироватьРезультатОтправки(ДанныеОтправкиСообщения, Ответ)
	Набор = НаборСОтбором(ДанныеОтправкиСообщения.ВнешнийИсточник, ДанныеОтправкиСообщения.Идентификатор);
	Набор.Прочитать();
	ДатаОтправки = ТекущаяДатаСеанса();
	Если Ответ = "Persisted" Тогда
		Набор[0].Отправлено = Истина;
		Набор[0].ПериодОтправкиСообщения = ДатаОтправки;
	Иначе
		Набор[0].ОшибкаОтправки = Истина;
		Набор[0].ОписаниеОшибки = Ответ;
		Набор[0].ПериодОтправкиСообщения = ДатаОтправки;
	КонецЕсли;
	Набор.Записать();
	
КонецПроцедуры

Функция ЗаполненыКлючевыеПоля(ДанныеОтправкиСообщения)
	ПоляЗаполнены = ЗначениеЗаполнено(ДанныеОтправкиСообщения.ВнешнийИсточник)
		И ЗначениеЗаполнено(ДанныеОтправкиСообщения.Идентификатор)
		И ЗначениеЗаполнено(ДанныеОтправкиСообщения.Ключ)
		И ЗначениеЗаполнено(ДанныеОтправкиСообщения.Сообщение);
	Возврат ПоляЗаполнены;
КонецФункции
